{
  "version": "1.0",
  "truncation": null,
  "padding": {
    "strategy": "BatchLongest",
    "direction": "Right",
    "pad_to_multiple_of": null,
    "pad_id": 0,
    "pad_type_id": 0,
    "pad_token": "[PAD]"
  },
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[SOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "[EOS]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Whitespace"
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "[SOS]",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "[EOS]",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "[EOS]": {
        "id": "[EOS]",
        "ids": [
          2
        ],
        "tokens": [
          "[EOS]"
        ]
      },
      "[SOS]": {
        "id": "[SOS]",
        "ids": [
          1
        ],
        "tokens": [
          "[SOS]"
        ]
      }
    }
  },
  "decoder": null,
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": null,
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "[PAD]": 0,
      "[SOS]": 1,
      "[EOS]": 2,
      ":": 3,
      "A": 4,
      "E": 5,
      "F": 6,
      "G": 7,
      "H": 8,
      "I": 9,
      "J": 10,
      "K": 11,
      "L": 12,
      "M": 13,
      "N": 14,
      "O": 15,
      "P": 16,
      "R": 17,
      "T": 18,
      "U": 19,
      "W": 20,
      "_": 21,
      "a": 22,
      "c": 23,
      "d": 24,
      "e": 25,
      "f": 26,
      "g": 27,
      "h": 28,
      "i": 29,
      "j": 30,
      "k": 31,
      "l": 32,
      "m": 33,
      "n": 34,
      "o": 35,
      "p": 36,
      "r": 37,
      "s": 38,
      "t": 39,
      "u": 40,
      "w": 41,
      "I_": 42,
      "N_": 43,
      "RN_": 44,
      "TU": 45,
      "I_TU": 46,
      "I_TURN_": 47,
      "EF": 48,
      "GH": 49,
      "IGH": 50,
      "LEF": 51,
      "RIGH": 52,
      "I_TURN_LEF": 53,
      "I_TURN_RIGH": 54,
      "I_TURN_LEFT": 55,
      "I_TURN_RIGHT": 56,
      "ri": 57,
      "AL": 58,
      "JU": 59,
      "LO": 60,
      "MP": 61,
      "OK": 62,
      "RU": 63,
      "WAL": 64,
      "I_JU": 65,
      "I_LO": 66,
      "I_RU": 67,
      "I_WAL": 68,
      "I_JUMP": 69,
      "I_LOOK": 70,
      "I_RUN": 71,
      "I_WALK": 72,
      "ft": 73,
      "ce": 74,
      "nd": 75,
      "IN": 76,
      "OU": 77,
      "OUT": 78,
      "eft": 79,
      "gh": 80,
      "left": 81,
      "righ": 82,
      "right": 83,
      "hri": 84,
      "ice": 85,
      "tw": 86,
      "thri": 87,
      "twice": 88,
      "thrice": 89,
      "ar": 90,
      "it": 91,
      "op": 92,
      "os": 93,
      "ou": 94,
      "pos": 95,
      "arou": 96,
      "ite": 97,
      "oppos": 98,
      "around": 99,
      "opposite": 100,
      "aft": 101,
      "and": 102,
      "er": 103,
      "after": 104,
      "al": 105,
      "ju": 106,
      "lo": 107,
      "mp": 108,
      "ok": 109,
      "ru": 110,
      "wal": 111,
      "jump": 112,
      "look": 113,
      "run": 114,
      "walk": 115,
      "rn": 116,
      "tu": 117,
      "turn": 118
    },
    "merges": [
      [
        "I",
        "_"
      ],
      [
        "N",
        "_"
      ],
      [
        "R",
        "N_"
      ],
      [
        "T",
        "U"
      ],
      [
        "I_",
        "TU"
      ],
      [
        "I_TU",
        "RN_"
      ],
      [
        "E",
        "F"
      ],
      [
        "G",
        "H"
      ],
      [
        "I",
        "GH"
      ],
      [
        "L",
        "EF"
      ],
      [
        "R",
        "IGH"
      ],
      [
        "I_TURN_",
        "LEF"
      ],
      [
        "I_TURN_",
        "RIGH"
      ],
      [
        "I_TURN_LEF",
        "T"
      ],
      [
        "I_TURN_RIGH",
        "T"
      ],
      [
        "r",
        "i"
      ],
      [
        "A",
        "L"
      ],
      [
        "J",
        "U"
      ],
      [
        "L",
        "O"
      ],
      [
        "M",
        "P"
      ],
      [
        "O",
        "K"
      ],
      [
        "R",
        "U"
      ],
      [
        "W",
        "AL"
      ],
      [
        "I_",
        "JU"
      ],
      [
        "I_",
        "LO"
      ],
      [
        "I_",
        "RU"
      ],
      [
        "I_",
        "WAL"
      ],
      [
        "I_JU",
        "MP"
      ],
      [
        "I_LO",
        "OK"
      ],
      [
        "I_RU",
        "N"
      ],
      [
        "I_WAL",
        "K"
      ],
      [
        "f",
        "t"
      ],
      [
        "c",
        "e"
      ],
      [
        "n",
        "d"
      ],
      [
        "I",
        "N"
      ],
      [
        "O",
        "U"
      ],
      [
        "OU",
        "T"
      ],
      [
        "e",
        "ft"
      ],
      [
        "g",
        "h"
      ],
      [
        "l",
        "eft"
      ],
      [
        "ri",
        "gh"
      ],
      [
        "righ",
        "t"
      ],
      [
        "h",
        "ri"
      ],
      [
        "i",
        "ce"
      ],
      [
        "t",
        "w"
      ],
      [
        "t",
        "hri"
      ],
      [
        "tw",
        "ice"
      ],
      [
        "thri",
        "ce"
      ],
      [
        "a",
        "r"
      ],
      [
        "i",
        "t"
      ],
      [
        "o",
        "p"
      ],
      [
        "o",
        "s"
      ],
      [
        "o",
        "u"
      ],
      [
        "p",
        "os"
      ],
      [
        "ar",
        "ou"
      ],
      [
        "it",
        "e"
      ],
      [
        "op",
        "pos"
      ],
      [
        "arou",
        "nd"
      ],
      [
        "oppos",
        "ite"
      ],
      [
        "a",
        "ft"
      ],
      [
        "a",
        "nd"
      ],
      [
        "e",
        "r"
      ],
      [
        "aft",
        "er"
      ],
      [
        "a",
        "l"
      ],
      [
        "j",
        "u"
      ],
      [
        "l",
        "o"
      ],
      [
        "m",
        "p"
      ],
      [
        "o",
        "k"
      ],
      [
        "r",
        "u"
      ],
      [
        "w",
        "al"
      ],
      [
        "ju",
        "mp"
      ],
      [
        "lo",
        "ok"
      ],
      [
        "ru",
        "n"
      ],
      [
        "wal",
        "k"
      ],
      [
        "r",
        "n"
      ],
      [
        "t",
        "u"
      ],
      [
        "tu",
        "rn"
      ]
    ]
  }
}